<?php

namespace App\Enum;

class Rule
{
    public const MAP = [
        1 => '终端设备状态数据缺失',
        2 => '终端GSM信号值异常',
        3 => '传感器列表数据缺失',
        4 => '传感器连接状态异常',
        5 => '六轴SD数据缺失',
        6 => '传感器设备状态数据缺失',
        7 => '传感器蓝牙连接状态异常',
        8 => '油位数据缺失',
        9 => '油位传感器信号强度异常',
        10 => '传感器三轴数据缺失',
        11 => '传感器三轴数据异常',
    ];

    public const REASON = [
        1 => '1.设备离线  2.设备状态处于盲区',
        2 => '1.终端重启  2.设备状态处于盲区',
        3 => '1.终端与传感器断联  2.传感器自身异常连接',
        4 => '1.传感器断连  2.传感器信号差',
        5 => '1.传感器断连  2.传感器信号差',
        6 => '1.传感器异常重启  2.传感器连接异常',
        7 => '1.传感器异常重启  2.设备状态处于盲区 3传感器信号差',
        8 => '1.传感器异常重启  2.传感器连接异常',
        9 => '1.传感器硬件故障  2.传感器安装位置信号差',
        10 => '1.传感器异常重启 2.传感器信号差',
        11 => '1.传感器安装位置改变',
    ];

    public static function translate($index): string
    {
        return self::MAP[$index] ?? '';
    }
}
